In [1]:
import pandas as pd
import numpy as np
from scipy import stats

In [5]:
race=['w','w','b','b','w','b']
years_exp=[6,6,22,6,27,6]
df=pd.DataFrame({'race':race,'years_exp':years_exp})

In [11]:
df

  race  years_exp
0    w          6
1    w          6
2    b         22
3    b          6
4    w         27
5    b          6

In [12]:
df.describe()

       years_exp
count   6.000000
mean   12.166667
std     9.683319
min     6.000000
25%     6.000000
50%     6.000000
75%    18.000000
max    27.000000

'w'--white people, 'b'--black people
H0---Avg exp white=blck
H1=not equal

In [7]:
white=df[df['race']=='w']
black=df[df['race']=='b']

In [8]:
white

  race  years_exp
0    w          6
1    w          6
4    w         27

In [9]:
black

  race  years_exp
2    b         22
3    b          6
5    b          6

H0=Average exp. of white people is equal to avg. exp. of black people
H1=Average exp. of white people is not equal to avg. exp. of black people

In [13]:
two_sample=stats.ttest_ind(white['years_exp'],black['years_exp'])

In [14]:
two_sample

Ttest_indResult(statistic=0.18938850476964247, pvalue=0.8590101273992533)

p value> alpha.
Hence, H0(Null Hypothesis) can be accepted.
Both the sample have almost equal mean.